app/services/synthesizer.rb

SELECT COUNT(*) FROM `elevators`
SELECT COUNT(*) FROM `buildings`
SELECT COUNT(*) FROM `customers`
SELECT COUNT(*) FROM `elevators` WHERE `elevators`.`status` != 'active'
SELECT COUNT(*) FROM `quotes`
SELECT COUNT(*) FROM `leads`
SELECT COUNT(*) FROM `batteries`
SELECT COUNT(DISTINCT `addresses`.`city`) FROM `addresses`
---
    def self.synthesize
      total_elevators = Elevator.count
      total_buildings = Building.count
      total_customers = Customer.count
      out_of_service = Elevator.where.not(status:'active').count
      total_quotes = Quote.count
      total_leads = Leads.count
      total_batteries = Battery.count
      total_cities = Address.distinct.count(:city)