lib/tasks/createmap.rake

INSERT INTO `users` (`email`, `encrypted_password`, `first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('dario_rath@hickle.io', '$2a$12$s.go2h3Z/ZDyPzTEb6EPUe1vI89.8XhbCgL8widsUc8jq2VMOuxka', 'Belia', 'Hermann', '2021-10-17 00:00:00', '2022-03-25 06:04:30')
INSERT INTO `addresses` (`type_of_address`, `entity`, `number_and_street`, `city`, `postal_code`, `country`, `created_at`, `updated_at`) VALUES ('hybrid', 'N/A', '1518 Jenks Avenue', 'Panama City', '32405', 'FL', '2022-03-25 06:04:30', '2022-03-25 06:04:30')
INSERT INTO `customers` (`customer_creation_date`, `company_name`, `full_name_company_contact`, `company_contact_phone`, `email_company`, `company_description`, `full_name_service_technical_authority`, `technical_authority_phone`, `technical_authority_email`, `created_at`, `updated_at`, `user_id`, `address_id`) VALUES ('2021-10-17 00:00:00', 'WaelchiShanahan', 'GradyOsinski', '908-607-2940', 'van_jaskolskibergestokescom', 'streamline vertical platforms', 'BeliaHermann', '1-952-168-7520 x32538', 'dario_rath@hickle.io', '2021-10-17 00:00:00', '2022-03-25 06:04:30', 32, 21)
INSERT INTO `google_maps` (`latitude`, `longitude`, `location`, `number_of_floors`, `client_name`, `number_of_batteries`, `number_of_columns`, `number_of_elevators`, `full_name_technical_contact`, `created_at`, `updated_at`, `customer_id`) VALUES (30.176582, -85.662077, '1518 Jenks Avenue, Panama City, FL, 32405', 13, 'GradyOsinski', 3, 3, 2, 'BeliaHermann', '2022-03-25 06:04:30', '2022-03-25 06:04:30', 21)
---
    task :make => :environment do
        puts "Generating new Google Map addition..."
        json = File.read("rrad/addresses-us-all.min.json")
        hash = JSON.parse(json, object_class: OpenStruct)
        randAdd = hash['addresses'].sample
        typeAddress = ["residential", "commercial", "corporate", "hybrid"]
        if randAdd.address2.length != 0
        fullAddress = randAdd.address1 + ", " + randAdd.city + ", "  + randAdd.state + ", "  + randAdd.postalCode
        address2 = randAdd.address2
        else
        fullAddress = randAdd.address1 + ", "  + randAdd.city + ", "  + randAdd.state + ", "  + randAdd.postalCode
        address2 = "N/A"
        end
        numberBatteries = Random.new.rand(1..3)
        numberColumns = Random.new.rand(1..4)
        numberElevators = Random.new.rand(1..6)
        floorsServed = Random.new.rand(10..100)

            user = User.create(
            last_name: Faker::Name.last_name.gsub(/\W/, ''),
            first_name: Faker::Name.first_name.gsub(/\W/, ''),
            email: Faker::Internet.email,
            password: 123456,
            created_at: Faker::Date.between(from: '2019-01-01', to: Date.today)
            )
            address = Address.create!(
                type_of_address: typeAddress.sample,
                entity: "N/A",
                number_and_street:randAdd.address1,
                city: randAdd.city,
                postal_code: randAdd.postalCode,
                country: randAdd.state,
            )
            customer = Customer.create!(
                customer_creation_date: user.created_at,
                company_name: Faker::Company.name.gsub(/\W/, ''),
                full_name_company_contact: Faker::Name.name.gsub(/\W/, ''),
                company_contact_phone: Faker::PhoneNumber.phone_number,
                email_company: Faker::Internet.email.gsub(/\W/, ''),
                company_description: Faker::Company.bs,
                full_name_service_technical_authority: (user.first_name + user.last_name),
                technical_authority_phone: Faker::PhoneNumber.phone_number,
                technical_authority_email: user.email,
                created_at: user.created_at,
                user_id: user.id,
                address_id: address.id
            )
            map = GoogleMap.create!(
                customer_id: customer.id,
                latitude: randAdd.coordinates.lat,
                longitude: randAdd.coordinates.lng,
                location: address.number_and_street + ", " + address.city + ", " + address.country + ", " + address.postal_code,
                number_of_floors: floorsServed,
                client_name: customer.full_name_company_contact,
                number_of_batteries: numberBatteries,
                number_of_columns: numberColumns,
                number_of_elevators: numberElevators,
                full_name_technical_contact: customer.full_name_service_technical_authority
            )