app/controllers/leads_controller.rb

  def create

      @fullname = params[:fullname]
      @companyname = params[:companyname]
      @email = params[:email]
      @phone = params[:phone]
      @projectname = params[:projectname]
      @projectdescription= params[:projectdescription]
      @departmentincharge = params[:departmentincharge]
      @message = params[:message]
      @id = params[:id]

      @leads = Leads.new(
        fullname: @fullname,
        companyname: @companyname,
        email: @email, phone: @phone,
        projectname: @projectname,
        projectdescription: @projectdescription,
        departmentincharge: @departmentincharge,
        message: @message,
        customer_id: @id
      )
      @leads.attachment.attach(params[:attachment])
---
INSERT INTO `leads` (`fullname`, `companyname`, `email`, `phone`, `projectname`, `projectdescription`, `departmentincharge`, `message`, `created_at`, `updated_at`) VALUES ('John Johnson', 'Blah enterprises', 'blah@blah.com', '555-555-5556', 'John\'s John', 'Portable John', 'Commercial', 'testr', '2022-03-26 02:19:32', '2022-03-26 02:19:32')

  def create_customer
    customer = Customer.create!(
      customer_creation_date: Time.current,
      company_name: @companyname,
      full_name_company_contact: @fullname,
      company_contact_phone: @phone,
      email_company: @email,
      company_description: Faker::Company.bs,
      full_name_service_technical_authority: Faker::Name.name.gsub(/\W/, ''),
      technical_authority_phone: Faker::PhoneNumber.phone_number,
      technical_authority_email: Faker::Internet.email.gsub(/\W/, '')
    )
---
INSERT INTO `customers` (`customer_creation_date`, `company_name`, `full_name_company_contact`, `company_contact_phone`, `email_company`, `company_description`, `full_name_service_technical_authority`, `technical_authority_phone`, `technical_authority_email`, `created_at`, `updated_at`) VALUES ('2022-03-26 02:19:33', 'Blah enterprises', 'John Johnson', '555-555-5556', 'blah@blah.com', 'target B2C interfaces', 'DongJakubowski', '963-999-9936 x1447', 'saundra_hayeshuelsio', '2022-03-26 02:19:33', '2022-03-26 02:19:33')