app/controllers/quotes_controller.rb

  def index
    warden.authenticate!
    @quotes = Quote.all
---
SELECT `quotes`.* FROM `quotes`